In [53]:
data = {"id":[1,2,3],"email":['a@b.com','c@d.com','a@b.com']}

In [54]:
import pandas as pd

In [55]:
person = pd.DataFrame(data)

In [56]:
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [57]:
person = person.merge(person,left_on='email',right_on='email',suffixes=['_person1','_person2'])

In [58]:
person

   id_person1    email  id_person2
0           1  a@b.com           1
1           1  a@b.com           3
2           3  a@b.com           1
3           3  a@b.com           3
4           2  c@d.com           2

In [59]:
#person = person.rename(columns={"email":"Email"})

In [60]:
person

   id_person1    email  id_person2
0           1  a@b.com           1
1           1  a@b.com           3
2           3  a@b.com           1
3           3  a@b.com           3
4           2  c@d.com           2

In [61]:
person = person[person['id_person1']!=person['id_person2']]

In [62]:
person = pd.DataFrame({"Email":person['email'].unique()})

In [63]:
person

     Email
0  a@b.com